// ===============================================================================
// Copyright (C)  All Rights Reserved
// 模块描述: 数据区定义及采样通道模拟仿真数据
// 模块版本: V1.00
// 创建人员: zhanjw
// 创建时间: 2018-09-01
// ===============================================================================
// 程序修改记录(最新的放在最前面):
// <版本号> <修改日期>, <修改人员>: <修改功能概述>
// ===============================================================================

#include "Data.h"

//========================================================
// 系数区
//========================================================
// FFT的正余弦系数
// [1维]:采样频率N:20、40、80
// [2维]:谐波次数H:1~13
// [3维]:采样序号D:0~N-1
// 正弦系数 sin(H*D*(2pi/N)) 再放大2^12倍 16位定点数存储
SINT16  g_s16FFTSinCoe[CN_SAM_RATIO_NUM][CN_ANA_HARM_MAX][CN_SAM_DOT_MAX];
SINT16  g_s16FFTCosCoe[CN_SAM_RATIO_NUM][CN_ANA_HARM_MAX][CN_SAM_DOT_MAX];

//========================================================
// 采样数据区
//========================================================
// 采样通道模拟仿真数据区
// [1维]:采样频率N: 20、40、80
// [2维]:模拟量通道C:0~15
// [3维]:采样序号D:0~N-1(双倍缓存)
// 放大500倍(单位:电流通道2mA) 16位定点数 双倍缓存
SINT16  g_s16SamData[CN_SAM_RATIO_NUM][CN_SAM_CHAN_MAX][CN_SAM_DOT_MAX*2];

// 采样通道差分数据区
SINT16  g_s16DifData[CN_SAM_RATIO_NUM][CN_SAM_CHAN_MAX][CN_SAM_DOT_MAX*2];

//========================================================
// FFT结果输出区
//========================================================
// 模拟量向量FFT结果
// [1维]:采样频率N  : 20、40、80
// [2维]:模拟量通道C: 0~15
tagFFTData  g_tFFTData[CN_SAM_RATIO_NUM][CN_SAM_CHAN_MAX];

//========================================================
// 正切数据表
//========================================================
// 计算相角所用表格 (TAN@)*500 (单位:0.5° 放大500倍)
const UINT16 g_u16Tan_tab[180]=
{
//  0.5,1.0,1.5,2.0,2.5,3.0,3.5,4.0,4.5,5.0,5.5,6.0,6.6,7.0,7.5,8.0,8.5,9.0,9.5,10.0,
    5,  9,  13, 17, 22, 26, 31, 35, 39, 44, 48, 53, 57, 61, 66, 70, 75, 79, 84, 88,
//  10.5, 11.5,  12.5 13.5 14.5 15.5 16.5, 17.5   18.5  , 19.5
    93, 97, 102,106, 111,115,120,125,129,134,139,143,148,153,158,162,167,172,177,182,
//  20.5, 21.5   22.5 23.5 24.5   25.5 26.5 27.5   28.5 29.5
    187,192,197,202,207,212,217,223,228,233,238,244,249,255,260,266,271,277,283,289,
//  30.5 31.5 32.5   33.5 34.5 35.5   36.5 37.5 38.5   39.5
    295,300,306,312,319,325,331,337,344,350,357,363,370,377,384,391,398,405,412,420,
//  40.5 41.5   42.5 43.5 44.5   45.5 46.5 47.5   48.5 49.5
    427,435,442,450,458,466,474,483,491,500,509,518,527,536,546,555,565,575,585,596,
//  50.5 51.5 52.5 53.5 54.5   55.5 56.5 57.5   58.5 59.5
    607,617,629,640,652,664,676,688,701,714,728,741,755,770,785,800,816,832,849,866,
//  60.5 61.5   62.5 63.5   64.5 65.5 66.5   67.5 68.5 69.5
    884,902,921,940,960,981,1003,1025,1048,1072,1097,1123,1150,1178,1207,1238,1269,1303,1337,1374,
//  70.5 71.5   72.5 73.5 74.5   75.5 76.5 77.5   78.5 79.5
    1412,1452,1494,1539,1586,1635,1688,1744,1803,1866,1933,2005,2083,2166,2255,2352,2458,2572,2698,2836,
//  80.5 81.5   82.5 83.5 84.5   85.5 86.5 87.5 88.5 89.5, 89.56
    2988,3157,3346,3558,3798,4072,4388,4757,5193,5715,6353,7150,8175,9541,11452,14318,19094,28645,57294,65535
};

//========================================================
// 仿真测试模拟量参数设置
//========================================================
// 通道1 仿真测试模拟量参数设置
tagAnaPara  g_tAna01[CN_ANA_HARM_PARA] =
{
//  谐波类型    有效值  初始相角
    {  0 ,      0.0,     CN_Ang2Rad(0.00)   },      // 直流
    {  1 ,      5.0,     CN_Ang2Rad(120 )   },      // 基波
    {  2 ,      0.0,     CN_Ang2Rad(0.00)   },      // 2 次谐波
    {  3 ,      0.0,     CN_Ang2Rad(0.00)   },      // 3 次谐波
    {  4 ,      0.0,     CN_Ang2Rad(0.00)   },      // 4 次谐波
    {  5 ,      0.0,     CN_Ang2Rad(0.00)   },      // 5 次谐波
    {  6 ,      0.0,     CN_Ang2Rad(0.00)   },      // 6 次谐波
    {  7 ,      0.0,     CN_Ang2Rad(0.00)   },      // 7 次谐波
    {  8 ,      0.0,     CN_Ang2Rad(0.00)   },      // 8 次谐波
    {  9 ,      0.0,     CN_Ang2Rad(0.00)   },      // 9 次谐波
    {  10,      0.0,     CN_Ang2Rad(0.00)   },      // 10次谐波
    {  11,      0.0,     CN_Ang2Rad(0.00)   },      // 11次谐波
    {  12,      0.0,     CN_Ang2Rad(0.00)   },      // 12次谐波
    {  13,      0.0,     CN_Ang2Rad(0.00)   },      // 13次谐波
};

// 通道2 仿真测试模拟量参数设置
tagAnaPara  g_tAna02[CN_ANA_HARM_PARA] =
{
//  谐波类型    有效值  初始相角
    {  0 ,      1.0,     CN_Ang2Rad(0.00)   },      // 直流
    {  1 ,      2.0,     CN_Ang2Rad(0   )   },      // 基波
    {  2 ,      0.2 ,    CN_Ang2Rad(10  )   },      // 2 次谐波
    {  3 ,      0.3 ,    CN_Ang2Rad(20  )   },      // 3 次谐波
    {  4 ,      0.4 ,    CN_Ang2Rad(30  )   },      // 4 次谐波
    {  5 ,      0.5 ,    CN_Ang2Rad(40  )   },      // 5 次谐波
    {  6 ,      0.6 ,    CN_Ang2Rad(50  )   },      // 6 次谐波
    {  7 ,      0.7 ,    CN_Ang2Rad(60  )   },      // 7 次谐波
    {  8 ,      0.8 ,    CN_Ang2Rad(70  )   },      // 8 次谐波
    {  9 ,      0.9 ,    CN_Ang2Rad(80  )   },      // 9 次谐波
    {  10,      0.10,    CN_Ang2Rad(90  )   },      // 10次谐波
    {  11,      0.11,    CN_Ang2Rad(100 )   },      // 11次谐波
    {  12,      0.12,    CN_Ang2Rad(110 )   },      // 12次谐波
    {  13,      0.13,    CN_Ang2Rad(120 )   },      // 13次谐波
};

// 通道3 仿真测试模拟量参数设置
tagAnaPara  g_tAna03[CN_ANA_HARM_PARA] =
{
//  谐波类型    有效值  初始相角
    {  0 ,      0.0,     CN_Ang2Rad(0.00)   },      // 直流
    {  1 ,      36.0,    CN_Ang2Rad(240 )   },      // 基波
    {  2 ,      0.0,     CN_Ang2Rad(0.00)   },      // 2 次谐波
    {  3 ,      0.0,     CN_Ang2Rad(0.00)   },      // 3 次谐波
    {  4 ,      0.0,     CN_Ang2Rad(0.00)   },      // 4 次谐波
    {  5 ,      0.0,     CN_Ang2Rad(0.00)   },      // 5 次谐波
    {  6 ,      0.0,     CN_Ang2Rad(0.00)   },      // 6 次谐波
    {  7 ,      0.0,     CN_Ang2Rad(0.00)   },      // 7 次谐波
    {  8 ,      0.0,     CN_Ang2Rad(0.00)   },      // 8 次谐波
    {  9 ,      0.0,     CN_Ang2Rad(0.00)   },      // 9 次谐波
    {  10,      0.0,     CN_Ang2Rad(0.00)   },      // 10次谐波
    {  11,      0.0,     CN_Ang2Rad(0.00)   },      // 11次谐波
    {  12,      0.0,     CN_Ang2Rad(0.00)   },      // 12次谐波
    {  13,      0.0,     CN_Ang2Rad(0.00)   },      // 13次谐波
};

// 仿真测试模拟量参数设置指针数组
tagAnaPara *g_ptAnaPara[CN_SAM_CHAN_MAX] =
{
    g_tAna01,   // 1  通道
    g_tAna02,   // 2  通道
    g_tAna03,   // 3  通道
    NULL,       // 4  通道
    NULL,       // 5  通道
    NULL,       // 6  通道
    NULL,       // 7  通道
    NULL,       // 8  通道
    NULL,       // 9  通道
    NULL,       // 10 通道
    NULL,       // 11 通道
    NULL,       // 12 通道
    NULL,       // 13 通道
    NULL,       // 14 通道
    NULL,       // 15 通道
    NULL,       // 16 通道
};

//========================================================
// 模拟采样点数据
//========================================================

// 模拟采样点数据
FLOAT32 Ana_Simulate( FLOAT32 fRad, tagAnaPara  *ptAnaPa )
{
    UINT32      i;
    FLOAT32     fVal;

    fVal = 0;
    for( i=0;i<CN_ANA_HARM_PARA;i++)    // 谐波次数H的循环
    {
        if( ptAnaPa[i].dwHarm==0 )      // 直流分量
        {
            fVal += ptAnaPa[i].fAm;
        }
        else                            // 基波及谐波分量
        {
            // I*sqrt(2)*sin(α*H+θ) α:采样角度 H:谐波系数 θ:初始角
            fVal += ptAnaPa[i].fAm*CN_SQRT_2*sin( ptAnaPa[i].dwHarm*fRad + ptAnaPa[i].fAng );
        }
    }
    return(fVal);
}

// 计算采样通道模拟仿真数据
void Cal_Simulate_Sam_Data( void )
{
    UINT32      dwRatio, dwChanNO;
    UINT32      dwSamNO, dwSamPtr;
    UINT32      dwSamRate;
    SINT16      *ps16Sam, s16Sam;
    FLOAT32     fVal, fRad;
    tagAnaPara *ptAnaPara;

    for(dwRatio=0; dwRatio < CN_SAM_RATIO_NUM; dwRatio++)           // 1. 采样频率N的循环
    {
        dwSamRate = CN_SAM_RATE*(1<<dwRatio);                       // 采样频率(20、40、80)
        for(dwChanNO=0; dwChanNO < CN_SAM_CHAN_MAX; dwChanNO++)     // 2. 采样通道C的循环
        {
            ptAnaPara = g_ptAnaPara[dwChanNO];                      // 当前通道的仿真测试模拟量参数设置
            if( ptAnaPara==NULL )
            {
                continue;
            }
            ps16Sam = &(g_s16SamData[dwRatio][dwChanNO][0]);        // 采样通道的模拟仿真数据首地址
            for(dwSamNO=0; dwSamNO < dwSamRate; dwSamNO++)          // 3. 采样点数N的循环
            {
                fRad = 2*CN_PI*dwSamNO/dwSamRate;                   // 当前采样点对应的角度 α=n*(2pi/N)
                fVal = Ana_Simulate( fRad, ptAnaPara );             // 当前采样点的模拟仿真数据
                fVal*= CN_ANA_SAM_MAG;                              // 放大500倍 单位:电流通道2mA
                s16Sam = (SINT16)(fVal+0.5);                        // 16位定点数
                dwSamPtr = (dwSamNO+CN_SAM_PTR)%dwSamRate;          // 当前采样点的存储指针
                ps16Sam[dwSamPtr]           = (SINT16)fVal;         // 双倍缓存(第一区)
                ps16Sam[dwSamPtr+dwSamRate] = (SINT16)fVal;         // 双倍缓存(第二区)
            }
        }
    }
}

